Autodesk.Revit.DB.ColorFillScheme
Represents a color scheme could be used to colorfy elements in floor plan views and section views.
Remarks:
A color scheme is based on element category and one of the category parameter, it contains a
set of Autodesk.Revit.DB.ColorFillSchemeEntry which stores parameter value,
color, fill pattern and other entry data. The entry paramater values may be a range or a single value,
based on the Autodesk.Revit.DB.ColorFillScheme.IsByRange property. Then elements with the specified category
could be colored with the color and fill pattern of matching entry whose parameter value or value range
matches the element parameter value.
You can retrieve the entries with Autodesk.Revit.DB.ColorFillScheme.GetEntries, or modify entries with
Autodesk.Revit.DB.ColorFillScheme.AddEntry(Autodesk.Revit.DB.ColorFillSchemeEntry), Autodesk.Revit.DB.ColorFillScheme.RemoveEntry(Autodesk.Revit.DB.ColorFillSchemeEntry), Autodesk.Revit.DB.ColorFillScheme.UpdateEntry(Autodesk.Revit.DB.ColorFillSchemeEntry) and SetEntries().
Unlike most of the other elements, the color scheme works in an "asynchronous" way in UI:
If document elements change, the color scheme will not be updated immediately.
If color schemes changes, the document elements will not be updated immediately too.
API works slightly different with UI:
Autodesk.Revit.DB.ColorFillScheme.GetEntries will return the entries corresponding to the latest document elements status immediately.
The entries modification operation will retrieve the latest entries with Autodesk.Revit.DB.ColorFillScheme.GetEntries at first, and then modify
those entries by request, but document elements will still not be updated immediately.
To modify multiple entries, it's better to use SetEntries() but not modify them one by one with other methods
for better performance.
Notes:
To apply a color scheme whose Autodesk.Revit.DB.ColorFillScheme.CategoryId property is OST_Areas to an area plan view,
the Autodesk.Revit.DB.ColorFillScheme.AreaSchemeId property must be the same as the view if it is not used as a template.
To generate a new color scheme, you have to use Autodesk.Revit.DB.ColorFillScheme.Duplicate(System.String) method to duplicate form an existing one.
There should not exist two entries values that are the same in a color scheme. if the Autodesk.Revit.DB.ColorFillScheme.StorageType property is Double,
then the value accuracy should be based on Autodesk.Revit.DB.FormatOptions property.
Since:
2022